000100*****************************************************************
000200* COPYBOOK: CONSTANT *
000300* PROPOSITO: CONSTANTES DEL SISTEMA DE BIBLIOTECA *
000400* AUTOR: ESTUDIANTE KC03G24 *
000500* FECHA: 15/03/2025 *
000600* VERSION: 1.0 *
000700*****************************************************************
000800*
000900* CONSTANTES GENERALES
001000*
001100 01 CONSTANTES-SISTEMA.
001200     05 CONST-NOMBRE-SISTEMA PIC X(30)
001300     VALUE 'SISTEMA BIBLIOTECA UNLAM'.
001400     05 CONST-VERSION PIC X(5) VALUE 'V1.0'.
001500     05 CONST-UNIVERSIDAD PIC X(40)
001600     VALUE 'UNIVERSIDAD NACIONAL DE LA MATANZA'.
001700*
001800* CONSTANTES DE BUSINESS RULES
001900*
002000 01 CONSTANTES-NEGOCIO.
002100     05 CONST-DIAS-PRESTAMO-EST PIC 9(2) VALUE 15.
002200     05 CONST-DIAS-PRESTAMO-DOC PIC 9(2) VALUE 30.
002300     05 CONST  -MAX-LIBROS-EST PIC 9(2) VALUE 03.
002400     05 CONST-MAX-LIBROS-DOC PIC 9(2) VALUE 10.
002500     05 CONST-MULTA-DIA PIC 9(3)V99 VALUE 50.00.
002600*
002700* CONSTANTES DE REPORTES
002800*
002900 01 CONSTANTES-REPORTE.
003000     05 CONST-LINEAS-PAGINA PIC 9(2) VALUE 60.
003100     05 CONST-LINEAS-CABECERA PIC 9(2) VALUE 05.
003200     05 CONST-ANCHO-REPORTE PIC 9(3) VALUE 133.
