000100*****************************************************************
000200* COPYBOOK: LIBROS *
000300* PROPOSITO: ESTRUCTURA DE DATOS PARA LIBROS *
000400* AUTOR: ESTUDIANTE KC03G24 *
000500* FECHA: 15/03/2025 *
000600* VERSION: 1.0 *
000700*****************************************************************
000800*
000900* ESTRUCTURA PRINCIPAL DEL LIBRO
001000 01 REG-LIBRO.
001100     05 LIB-CODIGO PIC X(10).
001200     05 LIB-TITULO PIC X(60).
001300     05 LIB-AUTOR PIC X(40).
001400     05 LIB-EDITORIAL PIC X(30).
001500     05 LIB-ANIO-PUBLICACION PIC 9(4).
001600     05 LIB-CATEGORIA PIC X(20).
001700     05 LIB-STOCK-TOTAL PIC 9(3).
001800     05 LIB-STOCK-DISPONIBLE PIC 9(3).
001900     05 LIB-UBICACION PIC X(10).
002000     05 LIB-FECHA-ALTA PIC X(10).
002100     05 LIB-USUARIO-ALTA PIC X(8).
002200     05 LIB-ESTADO PIC X(1).
002300        88 LIB-ACTIVO VALUE 'A'.
002400        88 LIB-INACTIVO VALUE 'I'.
002500        88 LIB-BAJA VALUE 'B'.
002600     05 FILLER PIC X(23).