000100*****************************************************************
000200* COPYBOOK: PRESTAMO *
000300* PROPOSITO: ESTRUCTURA DE DATOS PARA PRESTAMOS *
000400* AUTOR: ESTUDIANTE KC03G24 *
000500* FECHA: 15/03/2025 *
000600* VERSION: 1.0 *
000700*****************************************************************
000800*
000900* ESTRUCTURA PRINCIPAL DEL PRESTAMO
001000 01 REG-PRESTAMO.
001100     05 PRES-NUMERO PIC 9(8).
001200     05 PRES-CODIGO-LIBRO PIC X(10).
001300     05 PRES-CODIGO-USUARIO PIC X(10).
001400     05 PRES-FECHA-PRESTAMO PIC X(10).
001500     05 PRES-FECHA-DEVOLUCION PIC X(10).
001600     05 PRES-FECHA-LIMITE PIC X(10).
001700     05 PRES-ESTADO PIC X(1).
001800        88 PRES-PENDIENTE VALUE 'P'.
001900        88 PRES-DEVUELTO VALUE 'D'.
002000        88 PRES-VENCIDO VALUE 'V'.
002100     05 PRES-MULTA PIC 9(5)V99.
002200     05 PRES-OBSERVACIONES PIC X(100).
002300     05 FILLER PIC X(11).