000100*****************************************************************
000200* COPYBOOK: USUARIO *
000300* PROPOSITO: ESTRUCTURA DE DATOS PARA USUARIOS *
000400* AUTOR: ESTUDIANTE KC03G24 *
000500* FECHA: 15/03/2025 *
000600* VERSION: 1.0 *
000700*****************************************************************
000800*
000900* ESTRUCTURA PRINCIPAL DEL USUARIO
001000 01 REG-USUARIO.
001100     05 USU-CODIGO PIC X(10).
001200     05 USU-NOMBRE PIC X(30).
001300     05 USU-APELLIDO PIC X(30).
001400     05 USU-TIPO-USUARIO PIC X(1).
001500        88 USU-ESTUDIANTE VALUE 'E'.
001600        88 USU-DOCENTE VALUE 'D'.
001700        88 USU-ADMINISTRATIVO VALUE 'A'.
001800     05 USU-EMAIL PIC X(50).
001900     05 USU-TELEFONO PIC X(20).
002000     05 USU-DIRECCION PIC X(60).
002100     05 USU-FECHA-ALTA PIC X(10).
002200     05 USU-FECHA-BAJA PIC X(10).
002300     05 USU-ESTADO PIC X(1).
002400        88 USU-ACTIVO VALUE 'A'.
002500        88 USU-INACTIVO VALUE 'I'.
002600     05 FILLER PIC X(7). 